# Pandas Tips: `read_csv()`

In [13]:
import pandas as pd

Check your pandas version to ensure similar behavior. 

_Version 2.1.1 was released September 2023._

In [14]:
pd.__version__

'2.2.2'

## Basics

### Reading from computer file

In [15]:
ls

 O volume na unidade D ‚ IR2_SSD1
 O N£mero de S‚rie do Volume ‚ E66B-D670

 Pasta de D:\IR2_GRAFICOS L123\IR2_SEABORN\Videos\Pandas_Tips

27/06/2024  03:53    <DIR>          .
26/06/2024  16:17    <DIR>          ..
26/06/2024  16:32    <DIR>          .ipynb_checkpoints
27/06/2024  03:53            34.284 01_read_csv.ipynb
26/06/2024  16:17            36.162 02_read_excel.ipynb
26/06/2024  16:17            65.719 03_rename.ipynb
26/06/2024  16:17            20.014 04_astype.ipynb
26/06/2024  16:17            79.158 05_drop.ipynb
26/06/2024  16:17            68.569 06_dropna.ipynb
26/06/2024  16:17            83.357 07_drop_duplicates.ipynb
26/06/2024  16:17            36.118 08_query.ipynb
26/06/2024  16:29            45.067 customers.csv
27/06/2024  03:28    <DIR>          data
26/06/2024  16:30            11.495 ir2_leitura_1_M1.csv
26/06/2024  16:29            13.529 pet_data.csv
26/06/2024  16:29           125.629 store_data.xlsx
              12 arquivo(s)        619.101 bytes
               4 pasta(s)   235.103.244.288 bytes dispon¡veis

In [26]:
df = pd.read_csv(r'ir2_leitura_1_M1.csv',sep=';', decimal=',')

In [17]:
df.head()

   L1M1C1  L1M1C2  L1M1C3  L1M1C4  L1M1C5  L1M1C6  L1M1C7  L1M1C8
0   1.961   1.990   1.922   2.005   2.000   1.839   1.941   1.888
1   1.946   1.907   1.868   1.917   2.000   1.785   1.936   1.853
2   1.961   1.936   1.780   1.888   1.932   1.800   1.922   1.829
3   1.897   1.863   1.775   1.853   1.907   1.731   1.883   1.765
4   1.966   1.927   1.839   1.932   1.956   1.804   1.892   1.853

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   L1M1C1  240 non-null    float64
 1   L1M1C2  240 non-null    float64
 2   L1M1C3  240 non-null    float64
 3   L1M1C4  240 non-null    float64
 4   L1M1C5  240 non-null    float64
 5   L1M1C6  240 non-null    float64
 6   L1M1C7  240 non-null    float64
 7   L1M1C8  240 non-null    float64
dtypes: float64(8)
memory usage: 15.1 KB

In [19]:
df.describe()

,L1M1C1,L1M1C2,L1M1C3,L1M1C4,L1M1C5,L1M1C6,L1M1C7,L1M1C8
count,240.000000,240.000000,240.000000,240.000000,240.000000,240.000000,240.000000,240.000000
mean,1.916617,1.891346,1.807650,1.880954,1.918521,1.757192,1.877375,1.795167
std,0.044843,0.054526,0.059015,0.061929,0.054268,0.056832,0.053797,0.065324
min,1.824000,1.780000,1.716000,1.785000,1.824000,1.643000,1.756000,1.663000
25%,1.888000,1.863000,1.765000,1.841500,1.878000,1.714750,1.856750,1.760000
50%,1.914500,1.892500,1.794500,1.873000,1.912000,1.775000,1.883000,1.799500
75%,1.957250,1.922000,1.842500,1.917000,1.963250,1.800000,1.922000,1.848000
max,1.976000,1.990000,1.922000,2.005000,2.000000,1.839000,1.941000,1.888000

### Reading from a URL

In [20]:
df_url = pd.read_csv(r'https://raw.githubusercontent.com/HiramAmaral/Videos/master/Pandas_Tips/ir2_leitura_1_M1.csv', sep=';', decimal=',')

In [22]:
df_url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   L1M1C1  240 non-null    float64
 1   L1M1C2  240 non-null    float64
 2   L1M1C3  240 non-null    float64
 3   L1M1C4  240 non-null    float64
 4   L1M1C5  240 non-null    float64
 5   L1M1C6  240 non-null    float64
 6   L1M1C7  240 non-null    float64
 7   L1M1C8  240 non-null    float64
dtypes: float64(8)
memory usage: 15.1 KB

In [23]:
df_url.head()

   L1M1C1  L1M1C2  L1M1C3  L1M1C4  L1M1C5  L1M1C6  L1M1C7  L1M1C8
0   1.961   1.990   1.922   2.005   2.000   1.839   1.941   1.888
1   1.946   1.907   1.868   1.917   2.000   1.785   1.936   1.853
2   1.961   1.936   1.780   1.888   1.932   1.800   1.922   1.829
3   1.897   1.863   1.775   1.853   1.907   1.731   1.883   1.765
4   1.966   1.927   1.839   1.932   1.956   1.804   1.892   1.853

## $\star$ Level Up! $\star$

### Index by a column: `index_col`

In [27]:
df = pd.read_csv(
    r'ir2_leitura_1_M1.csv',sep=';', decimal=',',
    index_col = 'L1M1C1' 
)

In [28]:
df.head()

        L1M1C2  L1M1C3  L1M1C4  L1M1C5  L1M1C6  L1M1C7  L1M1C8
L1M1C1
1.961    1.990   1.922   2.005   2.000   1.839   1.941   1.888
1.946    1.907   1.868   1.917   2.000   1.785   1.936   1.853
1.961    1.936   1.780   1.888   1.932   1.800   1.922   1.829
1.897    1.863   1.775   1.853   1.907   1.731   1.883   1.765
1.966    1.927   1.839   1.932   1.956   1.804   1.892   1.853

### Specify missing value characters: `na_values`

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 240 entries, 1.961 to 1.824
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   L1M1C2  240 non-null    float64
 1   L1M1C3  240 non-null    float64
 2   L1M1C4  240 non-null    float64
 3   L1M1C5  240 non-null    float64
 4   L1M1C6  240 non-null    float64
 5   L1M1C7  240 non-null    float64
 6   L1M1C8  240 non-null    float64
dtypes: float64(7)
memory usage: 15.0 KB

In [14]:
df.Phone.value_counts()

Phone
?               31
602-310-9331     1
411-437-8722     1
563-866-1233     1
406-143-1943     1
                ..
384-871-5619     1
474-968-5565     1
244-703-2661     1
209-882-7213     1
412-368-2550     1
Name: count, Length: 938, dtype: int64

In [15]:
df.LTV.value_counts()

LTV
?              12
$496.87         1
$4,031.13       1
$2,158.26       1
$7,342.30       1
               ..
$901.23         1
$8,279.17       1
$907.24         1
$1,326.67       1
$14,686.60      1
Name: count, Length: 975, dtype: int64

In [32]:
df = pd.read_csv(
    'customers.csv',
    index_col = 'ID', #index by ID column
    na_values = '?'
)

In [33]:
df.head()

     First Name Last Name         Phone          LTV
ID
4576     Sophia    Walker  602-310-9331     $496.87
9488     Evelyn    Harris  171-363-6978  $38,424.41
7265      Lucas    Foster  139-658-8905  $14,413.64
8555     Elijah     Jones  538-241-9868  $13,440.49
7023      Mason    Taylor  937-595-5837   $1,777.37

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 4576 to 9062
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Last Name   1000 non-null   object
 2   Phone       937 non-null    object
 3   LTV         974 non-null    object
dtypes: object(4)
memory usage: 39.1+ KB

In [30]:
df.L1M1C2.value_counts()

L1M1C2
1.902    25
1.932    23
1.863    23
1.790    22
1.858    22
1.985    21
1.883    15
1.917    14
1.922    13
1.868    11
1.888     9
1.878     6
1.980     5
1.927     4
1.990     4
1.912     4
1.897     4
1.853     4
1.785     4
1.780     3
1.936     2
1.907     1
1.795     1
Name: count, dtype: int64

### Limiting the number of rows

In [31]:
df.shape

(240, 7)

In [32]:
df.tail()

        L1M1C2  L1M1C3  L1M1C4  L1M1C5  L1M1C6  L1M1C7  L1M1C8
L1M1C1
1.888    1.853   1.760   1.844   1.892   1.716   1.873   1.756
1.951    1.912   1.829   1.917   1.941   1.800   1.878   1.839
1.892    1.878   1.809   1.824   1.873   1.697   1.858   1.770
1.868    1.858   1.756   1.858   1.878   1.765   1.839   1.756
1.824    1.780   1.716   1.785   1.824   1.643   1.760   1.663

In [34]:
df = pd.read_csv(
    r'ir2_leitura_1_M1.csv',sep=';', decimal=',',
    index_col = 'L1M1C1', #index by ID column
    na_values = '?', #treat ? characters as missings
    nrows = 100
)

In [35]:
df.shape

(100, 7)

In [36]:
df.tail()

        L1M1C2  L1M1C3  L1M1C4  L1M1C5  L1M1C6  L1M1C7  L1M1C8
L1M1C1
1.834    1.790   1.721   1.790   1.829   1.648   1.765   1.667
1.971    1.985   1.917   2.005   1.995   1.829   1.941   1.883
1.941    1.902   1.858   1.912   1.995   1.780   1.932   1.848
1.956    1.932   1.775   1.883   1.922   1.800   1.912   1.824
1.897    1.858   1.765   1.848   1.902   1.721   1.883   1.760